[
  {
    "date": "Apr 22, 2016",
    "title": "Get array from document.querySelectorAll",
    "keyword": "es6, js ,javascript, querySelectorAll",
    "text": "I use document.querySelectorAll to find <strong>DOMs</strong>. You can use for loop to do something with those DOM, but use <strong>Array</strong> is good way."
  },
  {
    "date": "Mar 2, 2016",
    "title": "Animation without using jquery",
    "keyword": "javascript, js, jquery, animation",
    "text": "I used javascript to do animation without jquery. I would not be using any other jquery functions, and do not want to include jquery in my website just for doing animation."
  },
  {
    "date": "Feb 22, 2016",
    "title": "Check whether a property is supported from browsers",
    "keyword": "css, browser, support, style",
    "text": "By searching for the name of a property on the website <a href='http://caniuse.com/'>http://caniuse.com/</a> you can check whether or not this property is supported from browsers."
  },
  {
    "date": "Feb 22, 2016",
    "title": "CSS Gradient",
    "keyword": "css, gradient",
    "text": "Every gradient function needs at least two colors, and then a set percentage of the colors. The two main types are <strong>linear</strong> and <strong>radial</strong>. One is a gradient from the edge, and the other is from the center. You can check whether or not browsers support this property <a href='http://caniuse.com/#search=gradient'>here</a>."
  },
  {
    "date": "Feb 17, 2016",
    "title": "About meta tags",
    "keyword": "meta",
    "text": "Here are some <strong>meta tags</strong> from websites that I use."
  },
  {
    "date": "Feb 16, 2016",
    "title": "Get json without using jquery",
    "keyword": "javascript, js, jquery, json, ajax",
    "text": "If you need json but you do not want to use <strong>jquery</strong>, here is what I do."
  },
  {
    "date": "Feb 15, 2016",
    "title": "Wellcom to my blog",
    "keyword": "blog",
    "text": "Hi, everyone! This is my first article in my blog. This blog is used to record some information about my projects and some problemis which I encounter and solve. So, I hope you can find some useful information to you."
  }
]
